-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 13, 2025 at 06:26 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `mental`
--

-- --------------------------------------------------------

--
-- Table structure for table `chat_messages`
--

CREATE TABLE `chat_messages` (
  `email` varchar(256) NOT NULL,
  `user` varchar(256) NOT NULL,
  `content` varchar(256) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `chat_messages`
--

INSERT INTO `chat_messages` (`email`, `user`, `content`, `created_at`) VALUES
('', '1', 'こんにちは', '2025-01-11 02:06:37'),
('', '1', '悩みがあります', '2025-01-11 02:06:45'),
('', '1', '悩みがあります', '2025-01-11 02:42:54'),
('', '1', '悩みがあります', '2025-01-11 02:53:49'),
('', '1', '辛い出来事がありました', '2025-01-11 04:23:23'),
('', '1', '悩みがあります', '2025-01-11 07:21:22'),
('', '1', '悩みがあります', '2025-01-12 03:05:30'),
('', '1', '悩みがあります', '2025-01-12 03:08:04'),
('', '1', '悩みがあります', '2025-01-12 12:05:13'),
('', '1', '悩みがあります', '2025-01-12 12:05:38'),
('', '1', '悩みがあります', '2025-01-12 12:09:57'),
('', '1', '悩みがあります', '2025-01-12 12:10:13'),
('', '1', '悩みがあります', '2025-01-12 12:10:44'),
('', '1', '悩みがあります', '2025-01-12 12:11:15'),
('', '1', '悩みがあります', '2025-01-12 12:20:26'),
('', '1', '悩みがあります', '2025-01-12 12:20:44'),
('', '1', '悩みがあります', '2025-01-12 12:22:14'),
('', '1', '辛い出来事がありました', '2025-01-12 12:22:40'),
('', '1', '悩みがあります', '2025-01-12 12:27:08'),
('', '1', '辛い出来事がありました', '2025-01-12 12:27:18'),
('', '1', '相談したいことがあります。', '2025-01-13 05:30:47'),
('', '1', '先日、上司に話しかけても無視されて、挨拶への返事すらありませんでした。別の同僚には仲良く話していたことで自分だけが嫌われているように感じて、深く傷つきました。これは私の普段の振舞に問題があったのでしょうか。相手が誰でどんな人であろうと人間関係が円滑に築けないことに対してフラストレーションを抱えて悩んでしまう癖があります。そのせいで仕事の生産性も落ちているので、悩みたくないです。', '2025-01-13 05:38:17'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"9efbe10c-c66a-4436-ae35-27264ecf3df5\", \"message_id\": \"373035e1-ccc4-40a8-bb3b-006977e8c166\", \"created_at\": 1736746699, \"task_id\": \"3c2f4a4f-c21e-4ace-b8ee-af8007a56e75\", \"id\": \"373035e1-ccc4-40a8-bb3b-006977e8', '2025-01-13 05:38:22'),
('', '1', '特段兄もなかったと感じています。だからこそ、私が何か失礼なことをしてしまったのではないかと、自分の対人関係スキルに不安を抱いております。', '2025-01-13 06:48:17'),
('', '1', '私は人との距離感を間違える癖があります。純粋に人に興味があるため、人に近づきすぎてしまうことがあります。', '2025-01-13 06:52:20'),
('', '1', '自分が誰からも愛してもらえないのではないかと孤独感を感じます。また、全ての人から嫌われているのではないか、人間皆悪人なのではないかと偏った思考に陥り、自分の心を傷つけます。', '2025-01-13 07:02:54'),
('', '1', '私は完璧主義で繊細のため、人の気持ちを読もうとする癖があり、また傷つくことを過度に恐れています。そのため、人間関係でもネガティブ思考をしてしまい、傷つくくらいなら、1人でいいと考えてしまいます。', '2025-01-13 07:12:59'),
('', '1', '自分以外の周りの人が輝いていて見えて、自分が劣っていると感じた時にネガティブな思考に陥り、自信を失ってしまいます。', '2025-01-13 07:35:33'),
('', '1', '他者から強い発言を聞いたときに堪えてしまいます。', '2025-01-13 07:48:28'),
('', '1', '優しいことの人のことを馬鹿にしていたことで、自分が大事にしていた善や道徳観念が消えました。', '2025-01-13 07:49:59'),
('', '1', '具体的なことばかり聞いてきてイライラします。次の質問に行ってください。', '2025-01-13 07:50:24'),
('', '1', '私は強い人間になるために、どのようなネクストアクションを取るべきか決めたいです。', '2025-01-13 07:50:51'),
('', '1', 'ネクストアクションを教えてください', '2025-01-13 08:01:50'),
('', '1', '他人のことを考えて悩む時間を失くしたいです。', '2025-01-13 08:03:20'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"4948e9c9-7462-4d38-80aa-2214a4fff6bc\", \"message_id\": \"5e3c95c4-1d4d-44ac-9bcb-5fb8da4e7b2d\", \"created_at\": 1736755401, \"task_id\": \"f33da048-eaf5-4d5a-ae8a-c955490bcd74\", \"id\": \"5e3c95c4-1d4d-44ac-9bcb-5fb8da4e', '2025-01-13 08:03:21'),
('1@gmail.com', '1', '悩みがあります', '2025-01-13 09:57:03'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"8cba0676-8ef3-48b4-9c28-927cde386281\", \"message_id\": \"f1dedd47-70a8-42df-a757-e106d847f491\", \"created_at\": 1736762225, \"task_id\": \"7e3f9e39-6329-4a75-b6b5-d602111487f8\", \"id\": \"f1dedd47-70a8-42df-a757-e106d847', '2025-01-13 09:57:05'),
('', '1', '悩みがあります', '2025-01-13 11:33:10'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"aee152ee-6b82-40ea-a252-edb9dd7c64a0\", \"message_id\": \"d4b85a0e-617a-4b2d-bcd5-09644cf04102\", \"created_at\": 1736767991, \"task_id\": \"e3a2392b-2c80-4203-954b-31fd93c0fa06\", \"id\": \"d4b85a0e-617a-4b2d-bcd5-09644cf0', '2025-01-13 11:33:12'),
('', '1', '悩みがあります', '2025-01-13 11:43:06'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"514d30e3-8771-4f91-8cab-46dbea0f8c7a\", \"message_id\": \"e20d73d6-5d2f-48bf-9364-cde2a086b26f\", \"created_at\": 1736768588, \"task_id\": \"cf6ef694-833c-421b-aebb-403faafe695e\", \"id\": \"e20d73d6-5d2f-48bf-9364-cde2a086', '2025-01-13 11:43:08'),
('', '1', '悩みがあります', '2025-01-13 14:08:09'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"18876058-8e88-4ba7-885a-48c96ede4d65\", \"message_id\": \"4a713f44-7c4a-4e97-85af-e7d0324c987b\", \"created_at\": 1736777290, \"task_id\": \"f9c8c159-d58c-4ec6-9dcc-c9ad72dd20ef\", \"id\": \"4a713f44-7c4a-4e97-85af-e7d0324c', '2025-01-13 14:08:15'),
('', '1', '相談したいことがあります。', '2025-01-13 14:12:14'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"a2a38fd9-275c-4c7d-99bf-1887ea7ddd5e\", \"message_id\": \"09293ec9-2e4e-4071-a50e-6b272c25c5b5\", \"created_at\": 1736777535, \"task_id\": \"fb11d2fb-22a8-48d8-beee-72e5f198ffb4\", \"id\": \"09293ec9-2e4e-4071-a50e-6b272c25', '2025-01-13 14:12:17'),
('', '1', '悩みがあります', '2025-01-13 14:18:01'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"d43b8a23-34e8-4de3-a8e8-78387a46fc6d\", \"message_id\": \"c764fc84-fc47-4882-be22-cba8884d96fd\", \"created_at\": 1736777882, \"task_id\": \"23b35546-bf44-4654-892e-4d4210573a2e\", \"id\": \"c764fc84-fc47-4882-be22-cba8884d', '2025-01-13 14:18:05'),
('', '1', 'ネクストアクションを教えてください', '2025-01-13 14:21:35'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"ee6b39f3-45fd-4c4c-bebd-1455102bfc9e\", \"message_id\": \"08b6cbb2-cd4e-43a8-9d11-93f8380cff40\", \"created_at\": 1736778096, \"task_id\": \"90c8e9b6-3b51-4c26-87ce-6381b94b3ea7\", \"id\": \"08b6cbb2-cd4e-43a8-9d11-93f8380c', '2025-01-13 14:21:37'),
('', '1', '疲れました', '2025-01-13 14:41:00'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"c989a0da-8121-4c95-a893-0f0d7c5f45ec\", \"message_id\": \"e4126096-b8a3-4f0b-be04-c047c0337ec0\", \"created_at\": 1736779262, \"task_id\": \"a7cd7f6f-3f22-449a-8551-1da30bd54f96\", \"id\": \"e4126096-b8a3-4f0b-be04-c047c033', '2025-01-13 14:41:03'),
('', '1', 'ネクストアクションを教えてください', '2025-01-13 15:28:58'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"db608de5-e55f-4d9c-9b35-8c1fed1cac1a\", \"message_id\": \"b8357d9b-4e87-4425-ae8d-8bd5f2f27da5\", \"created_at\": 1736782138, \"task_id\": \"13411db3-95db-4f3b-8d1d-26c0b4526846\", \"id\": \"b8357d9b-4e87-4425-ae8d-8bd5f2f2', '2025-01-13 15:29:00'),
('', '1', '辛い出来事がありました', '2025-01-13 15:34:01'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"f4df8ae1-ce55-4762-8d29-49a8e98431b4\", \"message_id\": \"d313d6c1-6cf6-4182-884a-c3233533f1ec\", \"created_at\": 1736782442, \"task_id\": \"427431b2-e05f-4a07-897c-31d047813ba7\", \"id\": \"d313d6c1-6cf6-4182-884a-c3233533', '2025-01-13 15:34:03'),
('', '1', '眠いです。', '2025-01-13 15:39:15'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"804d1910-21f4-41a1-a333-1f23226aff35\", \"message_id\": \"3e1ccca8-11c9-4a00-831f-52bfabff52e6\", \"created_at\": 1736782755, \"task_id\": \"b3d4e4af-efbd-44bb-924a-f9af48f5264a\", \"id\": \"3e1ccca8-11c9-4a00-831f-52bfabff', '2025-01-13 15:39:18'),
('', '1', '辛い出来事がありました', '2025-01-13 15:43:32'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"92ed4f05-342b-41e7-bf6c-b1522061c87b\", \"message_id\": \"e33df949-9756-4ef6-81ba-e10db9340081\", \"created_at\": 1736783013, \"task_id\": \"c032053a-d2d9-40cb-9f59-8c1dee2e0400\", \"id\": \"e33df949-9756-4ef6-81ba-e10db934', '2025-01-13 15:43:34'),
('', '1', '疲れました', '2025-01-13 15:53:06'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"4eb4d5a4-c41f-40af-888f-d856d0e6af25\", \"message_id\": \"04b89d88-5da6-4171-8934-e8b9015ee503\", \"created_at\": 1736783587, \"task_id\": \"0e1aaf6e-09b3-4169-8bce-47804f48bfb1\", \"id\": \"04b89d88-5da6-4171-8934-e8b9015e', '2025-01-13 15:53:08'),
('', '1', '疲れました', '2025-01-13 15:58:20'),
('', '0', 'data: {\"event\": \"message\", \"conversation_id\": \"ea11f211-da3f-476f-91f2-224ece184e96\", \"message_id\": \"8286909b-357f-4485-b90b-2e1b56971a92\", \"created_at\": 1736783901, \"task_id\": \"9ff63e49-6af6-4f37-8af0-2cacb2b60588\", \"id\": \"8286909b-357f-4485-b90b-2e1b5697', '2025-01-13 15:58:30');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
